/**
  ******************************************************************************
  * 文件: ltk_debug.c
  * 作者: LeiTek (leitek.taobao.com)
  * 版本: V1.0.0
  * 描述: 调试模块中间件层，当没有定义 USE_NO_ASSERT，程序发现参数错误或者一些
  *       其它错误，直接跑到一个死循环，开发者可以debug看是哪一个地方发生异常。
  ******************************************************************************
  *
  *                  版权所有 (C): LeiTek (leitek.taobao.com)
  *                                www.leitek.com
  *
  ******************************************************************************
  */
  
/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#ifndef  USE_NO_ASSERT
  
/**
  * 描述: 当程序发生错误时，进入一个死循环
  * 参数: file: 指向源文件名的指针
  *       line: 发生错误的行号
  * 返回: 无
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
    /* 死循环 */
    while (1)
    {
    }
}
#endif

    
/******************* (C) COPYRIGHT 2010 STMicroelectronics ***************************/
